05-cavity-curve/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         6;

deltaT          0.00001;

writeControl    adjustableRunTime;

writeInterval   0.2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           1.0;

libs (
"libOpenFOAM.so"
"libsimpleSwakFunctionObjects.so"
"libswakFunctionObjects.so"
"libgroovyBC.so"
);



functions 
{
  #includeFunc  scalarTransport
  scalar1
  {
    type scalarTransport;
    libs ("libsolverFunctionObjects.so");
      enabled true;
      writeControl outputTime;
      log yes;
      nCorr 1;
      D 1e-10;
	
	   phi "phi";
  }
   vorticity1
 {
    // Mandatory entries (unmodifiable)
    type        vorticity;
    libs        ("fieldFunctionObjects.so");

    // Optional (inherited) entries
    field           U;
    result          vorticityField;
    region          region0;
    enabled         true;
    log             true;
    timeStart       0.00;
    timeEnd         100;
    executeControl  adjustableRunTime;
    executeInterval 0.01;
    writeControl    adjustableRunTime;
    writeInterval   0.2;
  }
  
  
   massfraction
   {
       type  patchAverage; //patchIntegrate; //patchAverage;
       functionObjectLibs
        (
           "libsimpleFunctionObjects.so"
        );
       verbose true;
	    fields (s);
       patches
	   (
         outlet
      );
       factor 1.0;
       outputControl timeStep;
       outputInterval 10;
   }
	
   surfaceFieldValue1
   {
      // Mandatory entries (unmodifiable)
      type            surfaceFieldValue;
      libs            ("fieldFunctionObjects.so");

      // Mandatory entries (runtime modifiable)
      fields          (s);
      operation       areaAverage;
      regionType      patch;
      name            outlet;

      // Optional (inherited) entries
      writeFields     false;
      region          region0;
      enabled         true;
      log             true;
      executeControl  timeStep;
      executeInterval 1;
      writeControl    timeStep;
      writeInterval   10;
   }
	velocity1
   {
       type  patchAverage; //patchIntegrate; //patchAverage;
       functionObjectLibs
        (
           "libsimpleFunctionObjects.so"
        );
       verbose true;
	   fields (U);
       patches
	   (
           inlet
		   outlet
        );
       factor 1.0;
       outputControl timeStep;
       outputInterval 1;
   }
}  





// ************************************************************************* //
