05-cavity-curve/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.01;

xmin -1;
xmax 5;
ymin 0;
ymax 0.5;
zmin 0;
zmax 0.1;

vertices
(
    (  $xmin  $ymin  $zmin  )
    (  $xmax  $ymin  $zmin  )
    (  $xmax  $ymax  $zmin  )
    (  $xmin  $ymax  $zmin  )
    (  $xmin  $ymin  $zmax )
    (  $xmax  $ymin  $zmax )
    (  $xmax  $ymax  $zmax )
    (  $xmin  $ymax  $zmax )
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 20 1) simpleGrading (1 1 1)
);

edges
(
		polyLine 0 1 ((	-1	0	0	)
(	0	0	0	)
(	0.025	0.031168683	0	)
(	0.05	0.06185099	0	)
(	0.075	0.091568132	0	)
(	0.1	0.119856385	0	)
(	0.125	0.146274318	0	)
(	0.15	0.17040969	0	)
(	0.175	0.191885876	0	)
(	0.2	0.210367746	0	)
(	0.225	0.225566899	0	)
(	0.25	0.237246155	0	)
(	0.275	0.245223264	0	)
(	0.3	0.249373747	0	)
(	0.325	0.249632835	0	)
(	0.35	0.245996487	0	)
(	0.375	0.238521445	0	)
(	0.4	0.227324357	0	)
(	0.425	0.212579947	0	)
(	0.45	0.194518299	0	)
(	0.475	0.173421258	0	)
(	0.5	0.149618036	0	)
(	0.525	0.123480075	0	)
(	0.55	0.095415248	0	)
(	0.575	0.065861498	0	)
(	0.6	0.035280002	0	)
(	0.625	0.004147973	0	)
(	0.65	-0.027048784	0	)
(	0.675	-0.057823453	0	)
(	0.7	-0.087695807	0	)
(	0.725	-0.116199697	0	)
(	0.75	-0.14289033	0	)
(	0.775	-0.167351207	0	)
(	0.8	-0.189200624	0	)
(	0.825	-0.208097629	0	)
(	0.85	-0.22374734	0	)
(	0.875	-0.235905548	0	)
(	0.9	-0.244382529	0	)
(	0.925	-0.249046003	0	)
(	0.95	-0.249823197	0	)
(	0.975	-0.246701984	0	)
(	1	-0.239731069	0	)
(	1.025	-0.22901923	0	)
(	1.05	-0.214733623	0	)
(	1.075	-0.19709717	0	)
(	1.1	-0.176385081	0	)
(	1.125	-0.152920562	0	)
(	1.15	-0.127069769	0	)
(	1.175	-0.099236095	0	)
(	1.2	-0.069853875	0	)
(	1.225	-0.039381608	0	)
(	1.25	-0.008294804	0	)
(	1.275	0.022921437	0	)
(	1.3	0.053779997	0	)
(	1.325	0.083799338	0	)
(	1.35	0.112511018	0	)
(	1.375	0.139467002	0	)
(	1.4	0.16424665	0	)
(	1.425	0.186463283	0	)
(	1.45	0.20577022	0	)
(	1.475	0.221866181	0	)
(	1.5	0.234499994	0	)
(	1.525	0.243474514	0	)
(	1.55	0.248649695	0	)
(	1.575	0.249944781	0	)
(	1.6	0.247339562	0	)
(	1.625	0.240874692	0	)
(	1.65	0.230651053	0	)
(	1.675	0.216828181	0	)
(	1.7	0.199621778	0	)
(	1.725	0.179300344	0	)
(	1.75	0.156180988	0	)
(	1.775	0.130624481	0	)
(	1.8	0.103029621	0	)
(	1.825	0.073827019	0	)
(	1.85	0.043472371	0	)
(	1.875	0.012439352	0	)
(	1.9	-0.01878778	0	)
(	1.925	-0.049721735	0	)
(	1.95	-0.079879798	0	)
(	1.975	-0.108791364	0	)
(	2	-0.136005278	0	)
(	2.025	-0.161096874	0	)
(	2.05	-0.183674608	0	)
(	2.075	-0.20338616	0	)
(	2.1	-0.21992394	0	)
(	2.125	-0.23302988	0	)
(	2.15	-0.242499467	0	)
(	2.175	-0.248184931	0	)
(	2.2	-0.249997552	0	)
(	2.225	-0.247909044	0	)
(	2.25	-0.241951999	0	)
(	2.275	-0.232219374	0	)
(	2.3	-0.218863044	0	)
(	2.325	-0.202091428	0	)
(	2.35	-0.182166244	0	)
(	2.375	-0.159398416	0	)
(	2.4	-0.13414323	0	)
(	2.425	-0.106794783	0	)
(	2.45	-0.077779839	0	)
(	2.475	-0.047551167	0	)
(	2.5	-0.016580474	0	)
(	2.525	0.014648951	0	)
(	2.55	0.045649784	0	)
(	2.575	0.075938267	0	)
(	2.6	0.105041759	0	)
(	2.625	0.13250611	0	)
(	2.65	0.157902747	0	)
(	2.675	0.180835364	0	)
(	2.7	0.200946107	0	)
(	2.725	0.217921152	0	)
(	2.75	0.231495611	0	)
(	2.775	0.241457658	0	)
(	2.8	0.247651839	0	)
(	2.825	0.249981496	0	)
(	2.85	0.248410275	0	)
(	2.875	0.242962695	0	)
(	2.9	0.233723764	0	)
(	2.925	0.220837651	0	)
(	2.95	0.204505441	0	)
(	2.975	0.184981992	0	)
(	3	0.16257196	0	)
(	3.025	0.137625048	0	)
(	3.05	0.110530542	0	)
(	3.075	0.081711245	0	)
(	3.1	0.05161687	0	)
(	3.125	0.020717032	0	)
(	3.15	-0.010506088	0	)
(	3.175	-0.041565265	0	)
(	3.2	-0.071975829	0	)
(	3.225	-0.101263235	0	)
(	3.25	-0.128970462	0	)
(	3.275	-0.154665148	0	)
(	3.3	-0.177946336	0	)
(	3.325	-0.198450731	0	)
(	3.35	-0.215858368	0	)
(	3.375	-0.229897608	0	)
(	3.4	-0.240349373	0	)
(	3.425	-0.247050566	0	)
(	3.45	-0.249896618	0	)
(	3.475	-0.248843116	0	)
(	3.5	-0.243906501	0	)
(	3.525	-0.235163807	0	)
(	3.55	-0.22275146	0	)
(	3.575	-0.206863151	0	)
(	3.6	-0.187746812	0	)
(	3.625	-0.165700746	0	)
(	3.65	-0.141068976	0	)
(	3.675	-0.114235872	0	)
(	3.7	-0.085620155	0	)
(	3.725	-0.055668364	0	)
(	3.75	-0.024847887	0	)
(	3.775	0.006360333	0	)
(	3.8	0.037469302	0	)
(	3.825	0.067993576	0	)
(	3.85	0.097456832	0	)
(	3.875	0.125399307	0	)
(	3.9	0.151384967	0	)
(	3.925	0.175008316	0	)
(	3.95	0.195900719	0	)
(	3.975	0.213736156	0	)
(	4	0.228236313	0	)
(	4.025	0.239174918	0	)
(	4.05	0.246381278	0	)
(	4.075	0.249742941	0	)
(	4.1	0.249207449	0	)
(	4.125	0.244783157	0	)
(	4.15	0.236539107	0	)
(	4.175	0.224603943	0	)
(	4.2	0.20916391	0	)
(	4.225	0.190459943	0	)
(	4.25	0.168783913	0	)
(	4.275	0.144474067	0	)
(	4.3	0.117909751	0	)
(	4.325	0.089505493	0	)
(	4.35	0.059704531	0	)
(	4.375	0.0289719	0	)
(	4.4	-0.002212827	0	)
(	5	0	0	)




	)
	polyLine 4 5 ((	-1	0	0.1	)
(	0	0	0.1	)
(	0.025	0.031168683	0.1	)
(	0.05	0.06185099	0.1	)
(	0.075	0.091568132	0.1	)
(	0.1	0.119856385	0.1	)
(	0.125	0.146274318	0.1	)
(	0.15	0.17040969	0.1	)
(	0.175	0.191885876	0.1	)
(	0.2	0.210367746	0.1	)
(	0.225	0.225566899	0.1	)
(	0.25	0.237246155	0.1	)
(	0.275	0.245223264	0.1	)
(	0.3	0.249373747	0.1	)
(	0.325	0.249632835	0.1	)
(	0.35	0.245996487	0.1	)
(	0.375	0.238521445	0.1	)
(	0.4	0.227324357	0.1	)
(	0.425	0.212579947	0.1	)
(	0.45	0.194518299	0.1	)
(	0.475	0.173421258	0.1	)
(	0.5	0.149618036	0.1	)
(	0.525	0.123480075	0.1	)
(	0.55	0.095415248	0.1	)
(	0.575	0.065861498	0.1	)
(	0.6	0.035280002	0.1	)
(	0.625	0.004147973	0.1	)
(	0.65	-0.027048784	0.1	)
(	0.675	-0.057823453	0.1	)
(	0.7	-0.087695807	0.1	)
(	0.725	-0.116199697	0.1	)
(	0.75	-0.14289033	0.1	)
(	0.775	-0.167351207	0.1	)
(	0.8	-0.189200624	0.1	)
(	0.825	-0.208097629	0.1	)
(	0.85	-0.22374734	0.1	)
(	0.875	-0.235905548	0.1	)
(	0.9	-0.244382529	0.1	)
(	0.925	-0.249046003	0.1	)
(	0.95	-0.249823197	0.1	)
(	0.975	-0.246701984	0.1	)
(	1	-0.239731069	0.1	)
(	1.025	-0.22901923	0.1	)
(	1.05	-0.214733623	0.1	)
(	1.075	-0.19709717	0.1	)
(	1.1	-0.176385081	0.1	)
(	1.125	-0.152920562	0.1	)
(	1.15	-0.127069769	0.1	)
(	1.175	-0.099236095	0.1	)
(	1.2	-0.069853875	0.1	)
(	1.225	-0.039381608	0.1	)
(	1.25	-0.008294804	0.1	)
(	1.275	0.022921437	0.1	)
(	1.3	0.053779997	0.1	)
(	1.325	0.083799338	0.1	)
(	1.35	0.112511018	0.1	)
(	1.375	0.139467002	0.1	)
(	1.4	0.16424665	0.1	)
(	1.425	0.186463283	0.1	)
(	1.45	0.20577022	0.1	)
(	1.475	0.221866181	0.1	)
(	1.5	0.234499994	0.1	)
(	1.525	0.243474514	0.1	)
(	1.55	0.248649695	0.1	)
(	1.575	0.249944781	0.1	)
(	1.6	0.247339562	0.1	)
(	1.625	0.240874692	0.1	)
(	1.65	0.230651053	0.1	)
(	1.675	0.216828181	0.1	)
(	1.7	0.199621778	0.1	)
(	1.725	0.179300344	0.1	)
(	1.75	0.156180988	0.1	)
(	1.775	0.130624481	0.1	)
(	1.8	0.103029621	0.1	)
(	1.825	0.073827019	0.1	)
(	1.85	0.043472371	0.1	)
(	1.875	0.012439352	0.1	)
(	1.9	-0.01878778	0.1	)
(	1.925	-0.049721735	0.1	)
(	1.95	-0.079879798	0.1	)
(	1.975	-0.108791364	0.1	)
(	2	-0.136005278	0.1	)
(	2.025	-0.161096874	0.1	)
(	2.05	-0.183674608	0.1	)
(	2.075	-0.20338616	0.1	)
(	2.1	-0.21992394	0.1	)
(	2.125	-0.23302988	0.1	)
(	2.15	-0.242499467	0.1	)
(	2.175	-0.248184931	0.1	)
(	2.2	-0.249997552	0.1	)
(	2.225	-0.247909044	0.1	)
(	2.25	-0.241951999	0.1	)
(	2.275	-0.232219374	0.1	)
(	2.3	-0.218863044	0.1	)
(	2.325	-0.202091428	0.1	)
(	2.35	-0.182166244	0.1	)
(	2.375	-0.159398416	0.1	)
(	2.4	-0.13414323	0.1	)
(	2.425	-0.106794783	0.1	)
(	2.45	-0.077779839	0.1	)
(	2.475	-0.047551167	0.1	)
(	2.5	-0.016580474	0.1	)
(	2.525	0.014648951	0.1	)
(	2.55	0.045649784	0.1	)
(	2.575	0.075938267	0.1	)
(	2.6	0.105041759	0.1	)
(	2.625	0.13250611	0.1	)
(	2.65	0.157902747	0.1	)
(	2.675	0.180835364	0.1	)
(	2.7	0.200946107	0.1	)
(	2.725	0.217921152	0.1	)
(	2.75	0.231495611	0.1	)
(	2.775	0.241457658	0.1	)
(	2.8	0.247651839	0.1	)
(	2.825	0.249981496	0.1	)
(	2.85	0.248410275	0.1	)
(	2.875	0.242962695	0.1	)
(	2.9	0.233723764	0.1	)
(	2.925	0.220837651	0.1	)
(	2.95	0.204505441	0.1	)
(	2.975	0.184981992	0.1	)
(	3	0.16257196	0.1	)
(	3.025	0.137625048	0.1	)
(	3.05	0.110530542	0.1	)
(	3.075	0.081711245	0.1	)
(	3.1	0.05161687	0.1	)
(	3.125	0.020717032	0.1	)
(	3.15	-0.010506088	0.1	)
(	3.175	-0.041565265	0.1	)
(	3.2	-0.071975829	0.1	)
(	3.225	-0.101263235	0.1	)
(	3.25	-0.128970462	0.1	)
(	3.275	-0.154665148	0.1	)
(	3.3	-0.177946336	0.1	)
(	3.325	-0.198450731	0.1	)
(	3.35	-0.215858368	0.1	)
(	3.375	-0.229897608	0.1	)
(	3.4	-0.240349373	0.1	)
(	3.425	-0.247050566	0.1	)
(	3.45	-0.249896618	0.1	)
(	3.475	-0.248843116	0.1	)
(	3.5	-0.243906501	0.1	)
(	3.525	-0.235163807	0.1	)
(	3.55	-0.22275146	0.1	)
(	3.575	-0.206863151	0.1	)
(	3.6	-0.187746812	0.1	)
(	3.625	-0.165700746	0.1	)
(	3.65	-0.141068976	0.1	)
(	3.675	-0.114235872	0.1	)
(	3.7	-0.085620155	0.1	)
(	3.725	-0.055668364	0.1	)
(	3.75	-0.024847887	0.1	)
(	3.775	0.006360333	0.1	)
(	3.8	0.037469302	0.1	)
(	3.825	0.067993576	0.1	)
(	3.85	0.097456832	0.1	)
(	3.875	0.125399307	0.1	)
(	3.9	0.151384967	0.1	)
(	3.925	0.175008316	0.1	)
(	3.95	0.195900719	0.1	)
(	3.975	0.213736156	0.1	)
(	4	0.228236313	0.1	)
(	4.025	0.239174918	0.1	)
(	4.05	0.246381278	0.1	)
(	4.075	0.249742941	0.1	)
(	4.1	0.249207449	0.1	)
(	4.125	0.244783157	0.1	)
(	4.15	0.236539107	0.1	)
(	4.175	0.224603943	0.1	)
(	4.2	0.20916391	0.1	)
(	4.225	0.190459943	0.1	)
(	4.25	0.168783913	0.1	)
(	4.275	0.144474067	0.1	)
(	4.3	0.117909751	0.1	)
(	4.325	0.089505493	0.1	)
(	4.35	0.059704531	0.1	)
(	4.375	0.0289719	0.1	)
(	4.4	-0.002212827	0.1	)
(	5	0	0.1	)



)

	polyLine 3 2((	-1	0.5	0	)
(	0	0.5	0	)
(	0.025	0.531168683	0	)
(	0.05	0.56185099	0	)
(	0.075	0.591568132	0	)
(	0.1	0.619856385	0	)
(	0.125	0.646274318	0	)
(	0.15	0.67040969	0	)
(	0.175	0.691885876	0	)
(	0.2	0.710367746	0	)
(	0.225	0.725566899	0	)
(	0.25	0.737246155	0	)
(	0.275	0.745223264	0	)
(	0.3	0.749373747	0	)
(	0.325	0.749632835	0	)
(	0.35	0.745996487	0	)
(	0.375	0.738521445	0	)
(	0.4	0.727324357	0	)
(	0.425	0.712579947	0	)
(	0.45	0.694518299	0	)
(	0.475	0.673421258	0	)
(	0.5	0.649618036	0	)
(	0.525	0.623480075	0	)
(	0.55	0.595415248	0	)
(	0.575	0.565861498	0	)
(	0.6	0.535280002	0	)
(	0.625	0.504147973	0	)
(	0.65	0.472951216	0	)
(	0.675	0.442176547	0	)
(	0.7	0.412304193	0	)
(	0.725	0.383800303	0	)
(	0.75	0.35710967	0	)
(	0.775	0.332648793	0	)
(	0.8	0.310799376	0	)
(	0.825	0.291902371	0	)
(	0.85	0.27625266	0	)
(	0.875	0.264094452	0	)
(	0.9	0.255617471	0	)
(	0.925	0.250953997	0	)
(	0.95	0.250176803	0	)
(	0.975	0.253298016	0	)
(	1	0.260268931	0	)
(	1.025	0.27098077	0	)
(	1.05	0.285266377	0	)
(	1.075	0.30290283	0	)
(	1.1	0.323614919	0	)
(	1.125	0.347079438	0	)
(	1.15	0.372930231	0	)
(	1.175	0.400763905	0	)
(	1.2	0.430146125	0	)
(	1.225	0.460618392	0	)
(	1.25	0.491705196	0	)
(	1.275	0.522921437	0	)
(	1.3	0.553779997	0	)
(	1.325	0.583799338	0	)
(	1.35	0.612511018	0	)
(	1.375	0.639467002	0	)
(	1.4	0.66424665	0	)
(	1.425	0.686463283	0	)
(	1.45	0.70577022	0	)
(	1.475	0.721866181	0	)
(	1.5	0.734499994	0	)
(	1.525	0.743474514	0	)
(	1.55	0.748649695	0	)
(	1.575	0.749944781	0	)
(	1.6	0.747339562	0	)
(	1.625	0.740874692	0	)
(	1.65	0.730651053	0	)
(	1.675	0.716828181	0	)
(	1.7	0.699621778	0	)
(	1.725	0.679300344	0	)
(	1.75	0.656180988	0	)
(	1.775	0.630624481	0	)
(	1.8	0.603029621	0	)
(	1.825	0.573827019	0	)
(	1.85	0.543472371	0	)
(	1.875	0.512439352	0	)
(	1.9	0.48121222	0	)
(	1.925	0.450278265	0	)
(	1.95	0.420120202	0	)
(	1.975	0.391208636	0	)
(	2	0.363994722	0	)
(	2.025	0.338903126	0	)
(	2.05	0.316325392	0	)
(	2.075	0.29661384	0	)
(	2.1	0.28007606	0	)
(	2.125	0.26697012	0	)
(	2.15	0.257500533	0	)
(	2.175	0.251815069	0	)
(	2.2	0.250002448	0	)
(	2.225	0.252090956	0	)
(	2.25	0.258048001	0	)
(	2.275	0.267780626	0	)
(	2.3	0.281136956	0	)
(	2.325	0.297908572	0	)
(	2.35	0.317833756	0	)
(	2.375	0.340601584	0	)
(	2.4	0.36585677	0	)
(	2.425	0.393205217	0	)
(	2.45	0.422220161	0	)
(	2.475	0.452448833	0	)
(	2.5	0.483419526	0	)
(	2.525	0.514648951	0	)
(	2.55	0.545649784	0	)
(	2.575	0.575938267	0	)
(	2.6	0.605041759	0	)
(	2.625	0.63250611	0	)
(	2.65	0.657902747	0	)
(	2.675	0.680835364	0	)
(	2.7	0.700946107	0	)
(	2.725	0.717921152	0	)
(	2.75	0.731495611	0	)
(	2.775	0.741457658	0	)
(	2.8	0.747651839	0	)
(	2.825	0.749981496	0	)
(	2.85	0.748410275	0	)
(	2.875	0.742962695	0	)
(	2.9	0.733723764	0	)
(	2.925	0.720837651	0	)
(	2.95	0.704505441	0	)
(	2.975	0.684981992	0	)
(	3	0.66257196	0	)
(	3.025	0.637625048	0	)
(	3.05	0.610530542	0	)
(	3.075	0.581711245	0	)
(	3.1	0.55161687	0	)
(	3.125	0.520717032	0	)
(	3.15	0.489493912	0	)
(	3.175	0.458434735	0	)
(	3.2	0.428024171	0	)
(	3.225	0.398736765	0	)
(	3.25	0.371029538	0	)
(	3.275	0.345334852	0	)
(	3.3	0.322053664	0	)
(	3.325	0.301549269	0	)
(	3.35	0.284141632	0	)
(	3.375	0.270102392	0	)
(	3.4	0.259650627	0	)
(	3.425	0.252949434	0	)
(	3.45	0.250103382	0	)
(	3.475	0.251156884	0	)
(	3.5	0.256093499	0	)
(	3.525	0.264836193	0	)
(	3.55	0.27724854	0	)
(	3.575	0.293136849	0	)
(	3.6	0.312253188	0	)
(	3.625	0.334299254	0	)
(	3.65	0.358931024	0	)
(	3.675	0.385764128	0	)
(	3.7	0.414379845	0	)
(	3.725	0.444331636	0	)
(	3.75	0.475152113	0	)
(	3.775	0.506360333	0	)
(	3.8	0.537469302	0	)
(	3.825	0.567993576	0	)
(	3.85	0.597456832	0	)
(	3.875	0.625399307	0	)
(	3.9	0.651384967	0	)
(	3.925	0.675008316	0	)
(	3.95	0.695900719	0	)
(	3.975	0.713736156	0	)
(	4	0.728236313	0	)
(	4.025	0.739174918	0	)
(	4.05	0.746381278	0	)
(	4.075	0.749742941	0	)
(	4.1	0.749207449	0	)
(	4.125	0.744783157	0	)
(	4.15	0.736539107	0	)
(	4.175	0.724603943	0	)
(	4.2	0.70916391	0	)
(	4.225	0.690459943	0	)
(	4.25	0.668783913	0	)
(	4.275	0.644474067	0	)
(	4.3	0.617909751	0	)
(	4.325	0.589505493	0	)
(	4.35	0.559704531	0	)
(	4.375	0.5289719	0	)
(	4.4	0.497787173	0	)
(	5	0.5	0	)



)

	polyLine 7 6 ((	-1	0.5	0.1	)
(	0	0.5	0.1	)
(	0.025	0.531168683	0.1	)
(	0.05	0.56185099	0.1	)
(	0.075	0.591568132	0.1	)
(	0.1	0.619856385	0.1	)
(	0.125	0.646274318	0.1	)
(	0.15	0.67040969	0.1	)
(	0.175	0.691885876	0.1	)
(	0.2	0.710367746	0.1	)
(	0.225	0.725566899	0.1	)
(	0.25	0.737246155	0.1	)
(	0.275	0.745223264	0.1	)
(	0.3	0.749373747	0.1	)
(	0.325	0.749632835	0.1	)
(	0.35	0.745996487	0.1	)
(	0.375	0.738521445	0.1	)
(	0.4	0.727324357	0.1	)
(	0.425	0.712579947	0.1	)
(	0.45	0.694518299	0.1	)
(	0.475	0.673421258	0.1	)
(	0.5	0.649618036	0.1	)
(	0.525	0.623480075	0.1	)
(	0.55	0.595415248	0.1	)
(	0.575	0.565861498	0.1	)
(	0.6	0.535280002	0.1	)
(	0.625	0.504147973	0.1	)
(	0.65	0.472951216	0.1	)
(	0.675	0.442176547	0.1	)
(	0.7	0.412304193	0.1	)
(	0.725	0.383800303	0.1	)
(	0.75	0.35710967	0.1	)
(	0.775	0.332648793	0.1	)
(	0.8	0.310799376	0.1	)
(	0.825	0.291902371	0.1	)
(	0.85	0.27625266	0.1	)
(	0.875	0.264094452	0.1	)
(	0.9	0.255617471	0.1	)
(	0.925	0.250953997	0.1	)
(	0.95	0.250176803	0.1	)
(	0.975	0.253298016	0.1	)
(	1	0.260268931	0.1	)
(	1.025	0.27098077	0.1	)
(	1.05	0.285266377	0.1	)
(	1.075	0.30290283	0.1	)
(	1.1	0.323614919	0.1	)
(	1.125	0.347079438	0.1	)
(	1.15	0.372930231	0.1	)
(	1.175	0.400763905	0.1	)
(	1.2	0.430146125	0.1	)
(	1.225	0.460618392	0.1	)
(	1.25	0.491705196	0.1	)
(	1.275	0.522921437	0.1	)
(	1.3	0.553779997	0.1	)
(	1.325	0.583799338	0.1	)
(	1.35	0.612511018	0.1	)
(	1.375	0.639467002	0.1	)
(	1.4	0.66424665	0.1	)
(	1.425	0.686463283	0.1	)
(	1.45	0.70577022	0.1	)
(	1.475	0.721866181	0.1	)
(	1.5	0.734499994	0.1	)
(	1.525	0.743474514	0.1	)
(	1.55	0.748649695	0.1	)
(	1.575	0.749944781	0.1	)
(	1.6	0.747339562	0.1	)
(	1.625	0.740874692	0.1	)
(	1.65	0.730651053	0.1	)
(	1.675	0.716828181	0.1	)
(	1.7	0.699621778	0.1	)
(	1.725	0.679300344	0.1	)
(	1.75	0.656180988	0.1	)
(	1.775	0.630624481	0.1	)
(	1.8	0.603029621	0.1	)
(	1.825	0.573827019	0.1	)
(	1.85	0.543472371	0.1	)
(	1.875	0.512439352	0.1	)
(	1.9	0.48121222	0.1	)
(	1.925	0.450278265	0.1	)
(	1.95	0.420120202	0.1	)
(	1.975	0.391208636	0.1	)
(	2	0.363994722	0.1	)
(	2.025	0.338903126	0.1	)
(	2.05	0.316325392	0.1	)
(	2.075	0.29661384	0.1	)
(	2.1	0.28007606	0.1	)
(	2.125	0.26697012	0.1	)
(	2.15	0.257500533	0.1	)
(	2.175	0.251815069	0.1	)
(	2.2	0.250002448	0.1	)
(	2.225	0.252090956	0.1	)
(	2.25	0.258048001	0.1	)
(	2.275	0.267780626	0.1	)
(	2.3	0.281136956	0.1	)
(	2.325	0.297908572	0.1	)
(	2.35	0.317833756	0.1	)
(	2.375	0.340601584	0.1	)
(	2.4	0.36585677	0.1	)
(	2.425	0.393205217	0.1	)
(	2.45	0.422220161	0.1	)
(	2.475	0.452448833	0.1	)
(	2.5	0.483419526	0.1	)
(	2.525	0.514648951	0.1	)
(	2.55	0.545649784	0.1	)
(	2.575	0.575938267	0.1	)
(	2.6	0.605041759	0.1	)
(	2.625	0.63250611	0.1	)
(	2.65	0.657902747	0.1	)
(	2.675	0.680835364	0.1	)
(	2.7	0.700946107	0.1	)
(	2.725	0.717921152	0.1	)
(	2.75	0.731495611	0.1	)
(	2.775	0.741457658	0.1	)
(	2.8	0.747651839	0.1	)
(	2.825	0.749981496	0.1	)
(	2.85	0.748410275	0.1	)
(	2.875	0.742962695	0.1	)
(	2.9	0.733723764	0.1	)
(	2.925	0.720837651	0.1	)
(	2.95	0.704505441	0.1	)
(	2.975	0.684981992	0.1	)
(	3	0.66257196	0.1	)
(	3.025	0.637625048	0.1	)
(	3.05	0.610530542	0.1	)
(	3.075	0.581711245	0.1	)
(	3.1	0.55161687	0.1	)
(	3.125	0.520717032	0.1	)
(	3.15	0.489493912	0.1	)
(	3.175	0.458434735	0.1	)
(	3.2	0.428024171	0.1	)
(	3.225	0.398736765	0.1	)
(	3.25	0.371029538	0.1	)
(	3.275	0.345334852	0.1	)
(	3.3	0.322053664	0.1	)
(	3.325	0.301549269	0.1	)
(	3.35	0.284141632	0.1	)
(	3.375	0.270102392	0.1	)
(	3.4	0.259650627	0.1	)
(	3.425	0.252949434	0.1	)
(	3.45	0.250103382	0.1	)
(	3.475	0.251156884	0.1	)
(	3.5	0.256093499	0.1	)
(	3.525	0.264836193	0.1	)
(	3.55	0.27724854	0.1	)
(	3.575	0.293136849	0.1	)
(	3.6	0.312253188	0.1	)
(	3.625	0.334299254	0.1	)
(	3.65	0.358931024	0.1	)
(	3.675	0.385764128	0.1	)
(	3.7	0.414379845	0.1	)
(	3.725	0.444331636	0.1	)
(	3.75	0.475152113	0.1	)
(	3.775	0.506360333	0.1	)
(	3.8	0.537469302	0.1	)
(	3.825	0.567993576	0.1	)
(	3.85	0.597456832	0.1	)
(	3.875	0.625399307	0.1	)
(	3.9	0.651384967	0.1	)
(	3.925	0.675008316	0.1	)
(	3.95	0.695900719	0.1	)
(	3.975	0.713736156	0.1	)
(	4	0.728236313	0.1	)
(	4.025	0.739174918	0.1	)
(	4.05	0.746381278	0.1	)
(	4.075	0.749742941	0.1	)
(	4.1	0.749207449	0.1	)
(	4.125	0.744783157	0.1	)
(	4.15	0.736539107	0.1	)
(	4.175	0.724603943	0.1	)
(	4.2	0.70916391	0.1	)
(	4.225	0.690459943	0.1	)
(	4.25	0.668783913	0.1	)
(	4.275	0.644474067	0.1	)
(	4.3	0.617909751	0.1	)
(	4.325	0.589505493	0.1	)
(	4.35	0.559704531	0.1	)
(	4.375	0.5289719	0.1	)
(	4.4	0.497787173	0.1	)
(	5	0.5	0.1	)


)

);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }


    walls
    {
        type wall;
        faces
        (
            (3 7 6 2)
	    (1 5 4 0)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
