05-cavity-curve/0/U
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volVectorField;
 object U;
}

dimensions [ 0 1 -1 0 0 0 0 ];

internalField uniform (0 0 0);

boundaryField
{
  inlet
  {
    type groovyBC;
    variables
      (
        "freq= 8;"
        "amp= 0.008;"
        "vel= 0.0100;"
      );
    valueExpression "vector (vel+(2*pi*freq*amp*sin(2*pi*freq*time())),0,0)";
    value uniform (0.01 0 0);
  }
  outlet
  {
    type zeroGradient;
  }
  wall
  {
    type noSlip;
  }
} 	// ************************************************************************* //

